In [32]:
import pandas as pd
from sqlalchemy import create_engine
from datetime import datetime

## EXTRACT

In [33]:
df_sales = pd.read_csv('D:/binar/platinum_challenge/Sales.csv')

In [34]:
df_sales

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,NaN,265598,10,1304,1,CAD
1,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD
2,366001,2,1/1/2016,1/13/2016,1269051,0,2007,1,USD
3,366002,1,1/1/2016,1/12/2016,266019,0,1106,7,CAD
4,366002,2,1/1/2016,1/12/2016,266019,0,373,1,CAD
...,...,...,...,...,...,...,...,...,...
62879,2243030,1,2/20/2021,NaN,1216913,43,632,3,USD
62880,2243031,1,2/20/2021,2/24/2021,511229,0,98,4,EUR
62881,2243032,1,2/20/2021,2/23/2021,331277,0,1613,2,CAD
62882,2243032,2,2/20/2021,2/23/2021,331277,0,1717,2,CAD
62883,2243032,3,2/20/2021,2/23/2021,331277,0,464,7,CAD

## PROFILING

In [35]:
#duplicate check
df_sales.duplicated()
df_sales[df_sales.duplicated()]

Empty DataFrame
Columns: [Order Number, Line Item, Order Date, Delivery Date, CustomerKey, StoreKey, ProductKey, Quantity, Currency Code]
Index: []

In [36]:
#null check
df_sales.isna().sum()
df_sales = df_sales.dropna(axis=0, how="all") 
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Number   62884 non-null  int64
 1   Line Item      62884 non-null  int64
 2   Order Date     62884 non-null  object
 3   Delivery Date  13165 non-null  object
 4   CustomerKey    62884 non-null  int64
 5   StoreKey       62884 non-null  int64
 6   ProductKey     62884 non-null  int64
 7   Quantity       62884 non-null  int64
 8   Currency Code  62884 non-null  object
dtypes: int64(6), object(3)
memory usage: 4.3+ MB

In [37]:
df_sales[df_sales.isna().any(axis=1)]

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,NaN,265598,10,1304,1,CAD
6,366004,1,1/1/2016,NaN,1107461,38,163,6,GBP
7,366004,2,1/1/2016,NaN,1107461,38,1529,2,GBP
8,366005,1,1/1/2016,NaN,844003,33,421,4,EUR
9,366007,1,1/1/2016,NaN,2035771,43,1617,1,USD
...,...,...,...,...,...,...,...,...,...
62867,2243025,1,2/20/2021,NaN,1909290,49,1128,2,USD
62868,2243025,2,2/20/2021,NaN,1909290,49,2511,2,USD
62869,2243026,1,2/20/2021,NaN,1737466,49,58,6,USD
62872,2243028,1,2/20/2021,NaN,1728060,66,1584,3,USD
62879,2243030,1,2/20/2021,NaN,1216913,43,632,3,USD

In [38]:
len(df_sales[df_sales.isna().any(axis=1)])

49719

In [39]:
#consistency check
df_sales.columns

Index(['Order Number', 'Line Item', 'Order Date', 'Delivery Date',
       'CustomerKey', 'StoreKey', 'ProductKey', 'Quantity', 'Currency Code'],
      dtype='object')

In [40]:
df_sales['Currency Code'].unique()

array(['CAD', 'USD', 'GBP', 'EUR', 'AUD'], dtype=object)

In [41]:
#validity check
df_sales.describe([.25,.5,.75, .9]).apply(lambda s: s.apply('{0:.1f}'.format))

      Order Number Line Item CustomerKey StoreKey ProductKey Quantity
count      62884.0   62884.0     62884.0  62884.0    62884.0  62884.0
mean     1430904.9       2.2   1180797.5     31.8     1125.9      3.1
std       453296.3       1.4    585963.4     23.0      709.2      2.3
min       366000.0       1.0       301.0      0.0        1.0      1.0
25%      1121017.0       1.0    680858.0      8.0      437.0      1.0
50%      1498015.5       2.0   1261200.5     37.0     1358.0      2.0
75%      1788010.0       3.0   1686496.0     53.0     1650.0      4.0
90%      1944006.7       4.0   1933298.0     61.0     1996.7      7.0
max      2243032.0       7.0   2099937.0     66.0     2517.0     10.0

## CLEANSING

In [42]:
df_sales_clean = df_sales.copy()

In [43]:
df_sales_clean

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,NaN,265598,10,1304,1,CAD
1,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD
2,366001,2,1/1/2016,1/13/2016,1269051,0,2007,1,USD
3,366002,1,1/1/2016,1/12/2016,266019,0,1106,7,CAD
4,366002,2,1/1/2016,1/12/2016,266019,0,373,1,CAD
...,...,...,...,...,...,...,...,...,...
62879,2243030,1,2/20/2021,NaN,1216913,43,632,3,USD
62880,2243031,1,2/20/2021,2/24/2021,511229,0,98,4,EUR
62881,2243032,1,2/20/2021,2/23/2021,331277,0,1613,2,CAD
62882,2243032,2,2/20/2021,2/23/2021,331277,0,1717,2,CAD
62883,2243032,3,2/20/2021,2/23/2021,331277,0,464,7,CAD

In [44]:
#rename columns
df_sales_clean.columns = map(str.lower, df_sales_clean.columns)

In [45]:
df_sales_clean.columns = df_sales_clean.columns.str.replace(' ', '_')

In [46]:
df_sales_clean.columns

Index(['order_number', 'line_item', 'order_date', 'delivery_date',
       'customerkey', 'storekey', 'productkey', 'quantity', 'currency_code'],
      dtype='object')

In [47]:
df_sales_clean = df_sales_clean.rename(columns={'customerkey': 'customer_key', 'storekey':'store_key', 'productkey':'product_key'})

In [48]:
df_sales_clean

,order_number,line_item,order_date,delivery_date,customer_key,store_key,product_key,quantity,currency_code
0,366000,1,1/1/2016,NaN,265598,10,1304,1,CAD
1,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD
2,366001,2,1/1/2016,1/13/2016,1269051,0,2007,1,USD
3,366002,1,1/1/2016,1/12/2016,266019,0,1106,7,CAD
4,366002,2,1/1/2016,1/12/2016,266019,0,373,1,CAD
...,...,...,...,...,...,...,...,...,...
62879,2243030,1,2/20/2021,NaN,1216913,43,632,3,USD
62880,2243031,1,2/20/2021,2/24/2021,511229,0,98,4,EUR
62881,2243032,1,2/20/2021,2/23/2021,331277,0,1613,2,CAD
62882,2243032,2,2/20/2021,2/23/2021,331277,0,1717,2,CAD
62883,2243032,3,2/20/2021,2/23/2021,331277,0,464,7,CAD

In [49]:
df_sales_clean['order_date'] = pd.to_datetime(df_sales_clean['order_date'])

In [50]:
df_sales_clean['delivery_date'] = pd.to_datetime(df_sales_clean['delivery_date'])

In [51]:
df_sales_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_number   62884 non-null  int64
 1   line_item      62884 non-null  int64
 2   order_date     62884 non-null  datetime64[ns]
 3   delivery_date  13165 non-null  datetime64[ns]
 4   customer_key   62884 non-null  int64
 5   store_key      62884 non-null  int64
 6   product_key    62884 non-null  int64
 7   quantity       62884 non-null  int64
 8   currency_code  62884 non-null  object
dtypes: datetime64[ns](2), int64(6), object(1)
memory usage: 4.3+ MB

In [52]:
df_sales_clean['currency_detail_code'] = df_sales_clean['order_date'].dt.strftime('%Y-%m-%d') + '_' + df_sales_clean['currency_code']

print("\nDataFrame dengan kolom 'currency_detail_code':")
print(df_sales_clean)

DataFrame dengan kolom 'currency_detail_code':
       order_number  line_item order_date delivery_date  customer_key  \
0            366000          1 2016-01-01           NaT        265598
1            366001          1 2016-01-01    2016-01-13       1269051
2            366001          2 2016-01-01    2016-01-13       1269051
3            366002          1 2016-01-01    2016-01-12        266019
4            366002          2 2016-01-01    2016-01-12        266019
...             ...        ...        ...           ...           ...
62879       2243030          1 2021-02-20           NaT       1216913
62880       2243031          1 2021-02-20    2021-02-24        511229
62881       2243032          1 2021-02-20    2021-02-23        331277
62882       2243032          2 2021-02-20    2021-02-23        331277
62883       2243032          3 2021-02-20    2021-02-23        331277

       store_key  product_key  quantity currency_code currency_detail_code
0             10         1304         1           CAD       2016-01-01_CAD
1              0         1048         2           USD       2016-01-01_USD
2              0         2007         1           USD       2016-01-01_USD
3              0         1106         7           CAD       2016-01-01_CAD
4              0          373         1           CAD       2016-01-01_CAD
...          ...          ...       ...           ...                  ...
62879         43          632         3           USD       2021-02-20_USD
62880          0           98         4           EUR       2021-02-20_EUR
62881          0         1613         2           CAD       2021-02-20_CAD
62882          0         1717         2           CAD       2021-02-20_CAD
62883          0          464         7           CAD       2021-02-20_CAD

[62884 rows x 10 columns]

In [53]:
df_sales_clean

,order_number,line_item,order_date,delivery_date,customer_key,store_key,product_key,quantity,currency_code,currency_detail_code
0,366000,1,2016-01-01,NaT,265598,10,1304,1,CAD,2016-01-01_CAD
1,366001,1,2016-01-01,2016-01-13,1269051,0,1048,2,USD,2016-01-01_USD
2,366001,2,2016-01-01,2016-01-13,1269051,0,2007,1,USD,2016-01-01_USD
3,366002,1,2016-01-01,2016-01-12,266019,0,1106,7,CAD,2016-01-01_CAD
4,366002,2,2016-01-01,2016-01-12,266019,0,373,1,CAD,2016-01-01_CAD
...,...,...,...,...,...,...,...,...,...,...
62879,2243030,1,2021-02-20,NaT,1216913,43,632,3,USD,2021-02-20_USD
62880,2243031,1,2021-02-20,2021-02-24,511229,0,98,4,EUR,2021-02-20_EUR
62881,2243032,1,2021-02-20,2021-02-23,331277,0,1613,2,CAD,2021-02-20_CAD
62882,2243032,2,2021-02-20,2021-02-23,331277,0,1717,2,CAD,2021-02-20_CAD
62883,2243032,3,2021-02-20,2021-02-23,331277,0,464,7,CAD,2021-02-20_CAD

## INGESTION

In [54]:
connection = 'postgresql://postgres:nunu16@localhost:5432/postgres'
engine = create_engine(connection)
conn2 = engine.connect()
print(conn2)

<sqlalchemy.engine.base.Connection object at 0x000002E9E2E7D730>

In [55]:
df_sales_clean.to_sql( 
        'sales', 
        con=engine,
        schema='platinum_base_layer',
        if_exists='replace',
        index=False,
        index_label = 'sales_key',
        method='multi'
        )

62884

In [56]:
from sqlalchemy import text

In [57]:
query_fk = [
    """ALTER TABLE platinum_base_layer.sales 
    ADD CONSTRAINT fkey_products FOREIGN KEY (product_key) REFERENCES platinum_base_layer.products(product_key)""",
    
    """ALTER TABLE platinum_base_layer.sales 
    ADD CONSTRAINT fkey_customers FOREIGN KEY (customer_key) REFERENCES platinum_base_layer.customers(customer_key)""",

    """ALTER TABLE platinum_base_layer.sales 
    ADD CONSTRAINT fkey_exrates FOREIGN KEY (currency_detail_code) REFERENCES platinum_base_layer.exchange_rates(currency_detail_code)""",

    """ALTER TABLE platinum_base_layer.sales 
    ADD CONSTRAINT fkey_stores FOREIGN KEY (store_key) REFERENCES platinum_base_layer.stores(store_key)"""
]

for query in query_fk:
    conn_2 = engine.connect()
    conn_2.execute(text(query))
    conn_2.commit()
    conn_2.close()